In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
names=pd.Series(['Fai', 'Mai', 'Maha'], index=[1, 2, 3])
names

1     Fai
2     Mai
3    Maha
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [4]:
names=names.set_axis([11, 12, 13])
names

11     Fai
12     Mai
13    Maha
dtype: object

## Q3: Retrieve First and second elements.

In [5]:
names[:2]

11    Fai
12    Mai
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [8]:
names=names.append(pd.Series(['Fai', 'Mai', 'Maha']))
names

C:\Users\fai-w\AppData\Local\Temp\ipykernel_5792\1006472835.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  names=names.append(pd.Series(['Fai', 'Mai', 'Maha']))

11     Fai
12     Mai
13    Maha
0      Fai
1      Mai
2     Maha
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [9]:
names=names.drop_duplicates()
names

11     Fai
12     Mai
13    Maha
dtype: object

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [12]:
edu=pd.read_csv("educ_figdp_1_Data.csv")
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [26]:
#will show 3 elements
locEx = edu.loc[:2, :]
locEx

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [27]:
#will show 2 elements
sliceEx = edu[:2]
sliceEx

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN

In [28]:
#Also:
#selecting from 1 column:
locEx = edu.loc[:2, ["Value"]]
locEx

  Value
0     :
1     :
2  5.00

In [32]:
#selecting from 1 columns
sliceEx = edu["Value"][:2]
sliceEx

0    :
1    :
Name: Value, dtype: object